
#************************************************ Домашнее задание *****************************************************
#********************************************( ДИНАМИЧЕСКАЯ ТИПИЗАЦИЯ )*************************************************

#
# Задание №1:
#    В проекте, где вы решаете домашние задания, создайте модуль 'module_1_3.py' и напишите весь код в нём.

#-----------------------------------------------------------------------------------------------------------------------
# Задание №2:
#    Создайте переменные разных типов данных:
#  - Создайте переменную name и присвойте ей значение вашего имени (строка).
#  - Выведите значение переменной name на экран.
#  - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#  - Выведите значение переменной age на экран.
#  - Перезапишите в age текущее значение переменной age + новое.
#  - Выведите измененное значение переменной age на экран.
#  - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#  - Выведите значение переменной is_student на экран.

#-----------------------------------------------------------------------------------------------------------------------
# Ответ:
# Задание №2:
name = "Name: Denis" # - Создал переменную (name) и присвоил ей текстовое значение ( str ) своего имени. "Name: Denis"
print(name, type(name)) # Name: Denis <class 'str'>
name = "Age: 47"     # - Создал переменную (name) и присвоил ей текстовое значение ( str ) значение -
#                      - своего  возраста. "Age: 47"
print(name, type(name)) # - Age: 47 <class 'str'>
name = "New Age: 40" # - Создал переменную (name) и присвоил ей текстовое значение ( str )  -
#                      - значение современного движения "New Age"
print(name, type(name)) # - New Age: 40 <class 'str'>
name = "I am a student at Urban University Academy"
                        # - Создал переменную (name) и присвоил ей логическое значение ( bool ) -
                        # - воего социального положения я студент академии  Urban University
print(name, type(True)) # - I am a student at Urban University Academy <class 'bool'>

#-----------------------------------------------------------------------------------------------------------------------
#D:\Программы\ProjectPyton\BasiesStructures\Scripts\python.exe "D:\Программы\ProjectPyton\Module 1.
# GIT Practice. Basic Data Structures\'module_1_3.py' (Homework).py"
# Name: Denis <class 'str'>
# Age: 47 <class 'str'>
# New Age: 40 <class 'str'>
# I am a student at Urban University Academy <class 'bool'>
#-----------------------------------------------------------------------------------------------------------------------
